Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueUnits
The units usable with the dimensions.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueUnits.Automatic
The unit of the value is selected automatically.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueUnits.Millimeter
The value is shown in millimeters.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueUnits.Centimeter
The value is shown in centimeters.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueUnits.Meter
The value is shown in meters.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueUnits.Inch
The value is shown in inches.